#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda_function_zip: Reading...
data.archive_file.lambda_function_zip: Read complete after 0s [id=f3232eed97ddc58a9b21e2484cddaea149813e3a]
data.aws_iam_policy_document.iam_invoke_lambda_policy_document: Reading...
data.aws_iam_policy_document.iam_invoke_lambda_policy_document: Read complete after 0s [id=2750682285]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.iot_monitoring_table will be created
  + resource "aws_dynamodb_table" "iot_monitoring_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "GardenID"
      + id               = (known after apply)
      + name             = "IoTMonitoringGardenMetrics"
      + range_key        = "Timestamp"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "GardenID"
          + type = "S"
        }
      + attribute {
          + name = "Timestamp"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_iam_policy.iam_policy_for_lambda will be created
  + resource "aws_iam_policy" "iam_policy_for_lambda" {
      + arn         = (known after apply)
      + description = "IAM Policy for AWS Lambda in IoT Monitoring"
      + id          = (known after apply)
      + name        = "iot_monitoring_lambda_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:table/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iot_monitoring_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role will be created
  + resource "aws_iam_role_policy_attachment" "attach_iam_policy_to_iam_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iot_monitoring_lambda_role"
    }

  # aws_iot_topic_rule.iot_rule will be created
  + resource "aws_iot_topic_rule" "iot_rule" {
      + arn         = (known after apply)
      + enabled     = true
      + id          = (known after apply)
      + name        = "esp32_garden_monitoring_rule"
      + sql         = "SELECT * FROM \"iot/esp32/garden/monitoring\""
      + sql_version = "2015-10-08"
      + tags_all    = (known after apply)

      + lambda {
          + function_arn = (known after apply)
        }
    }

  # aws_lambda_function.iot_monitoring_lambda will be created
  + resource "aws_lambda_function" "iot_monitoring_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./api/lambda_function.zip"
      + function_name                  = "iot_monitoring_lambda_function"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + logging_config {
          + application_log_level = (known after apply)
          + log_format            = (known after apply)
          + log_group             = (known after apply)
          + system_log_level      = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.decommission_access_topic_rule_permission will be created
  + resource "aws_lambda_permission" "decommission_access_topic_rule_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "iot_monitoring_lambda_function"
      + id                  = (known after apply)
      + principal           = "iot.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hugosrc, Action: `pull_request`*